Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/renesas/ek_ra6m5/lldp_agent_demo/iar/startup_ra6m5.c
#pragma weak ICU_IRQ0_IRQHandler = Default_Handler
#pragma weak ICU_IRQ1_IRQHandler = Default_Handler
#pragma weak ICU_IRQ2_IRQHandler = Default_Handler
#pragma weak ICU_IRQ3_IRQHandler = Default_Handler
#pragma weak ICU_IRQ4_IRQHandler = Default_Handler
#pragma weak ICU_IRQ5_IRQHandler = Default_Handler
#pragma weak ICU_IRQ6_IRQHandler = Default_Handler
#pragma weak ICU_IRQ7_IRQHandler = Default_Handler
#pragma weak ICU_IRQ8_IRQHandler = Default_Handler
#pragma weak ICU_IRQ9_IRQHandler = Default_Handler
#pragma weak ICU_IRQ10_IRQHandler = Default_Handler
#pragma weak ICU_IRQ11_IRQHandler = Default_Handler
#pragma weak ICU_IRQ12_IRQHandler = Default_Handler
#pragma weak ICU_IRQ13_IRQHandler = Default_Handler
#pragma weak ICU_IRQ14_IRQHandler = Default_Handler
#pragma weak ICU_IRQ15_IRQHandler = Default_Handler
#pragma weak DMAC0_INT_IRQHandler = Default_Handler
#pragma weak DMAC1_INT_IRQHandler = Default_Handler
#pragma weak DMAC2_INT_IRQHandler = Default_Handler
#pragma weak DMAC3_INT_IRQHandler = Default_Handler
#pragma weak DMAC4_INT_IRQHandler = Default_Handler
#pragma weak DMAC5_INT_IRQHandler = Default_Handler
#pragma weak DMAC6_INT_IRQHandler = Default_Handler
#pragma weak DMAC7_INT_IRQHandler = Default_Handler
#pragma weak DTC_COMPLETE_IRQHandler = Default_Handler
#pragma weak DTC_END_IRQHandler = Default_Handler
#pragma weak DMA_TRANSERR_IRQHandler = Default_Handler
#pragma weak ICU_SNOOZE_CANCEL_IRQHandler = Default_Handler
#pragma weak FCU_FIFERR_IRQHandler = Default_Handler
#pragma weak FCU_FRDYI_IRQHandler = Default_Handler
#pragma weak LVD_LVD1_IRQHandler = Default_Handler
#pragma weak LVD_LVD2_IRQHandler = Default_Handler
#pragma weak CGC_MOSC_STOP_IRQHandler = Default_Handler
#pragma weak LPM_SNOOZE_REQUEST_IRQHandler = Default_Handler
#pragma weak AGT0_INT_IRQHandler = Default_Handler
#pragma weak AGT0_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT0_COMPARE_B_IRQHandler = Default_Handler
#pragma weak AGT1_INT_IRQHandler = Default_Handler
#pragma weak AGT1_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT1_COMPARE_B_IRQHandler = Default_Handler
#pragma weak AGT2_INT_IRQHandler = Default_Handler
#pragma weak AGT2_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT2_COMPARE_B_IRQHandler = Default_Handler
#pragma weak AGT3_INT_IRQHandler = Default_Handler
#pragma weak AGT3_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT3_COMPARE_B_IRQHandler = Default_Handler
#pragma weak AGT4_INT_IRQHandler = Default_Handler
#pragma weak AGT4_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT4_COMPARE_B_IRQHandler = Default_Handler
#pragma weak AGT5_INT_IRQHandler = Default_Handler
#pragma weak AGT5_COMPARE_A_IRQHandler = Default_Handler
#pragma weak AGT5_COMPARE_B_IRQHandler = Default_Handler
#pragma weak IWDT_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak WDT_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak RTC_ALARM_IRQHandler = Default_Handler
#pragma weak RTC_PERIOD_IRQHandler = Default_Handler
#pragma weak RTC_CARRY_IRQHandler = Default_Handler
#pragma weak CAN_RXF_IRQHandler = Default_Handler
#pragma weak CAN_GLERR_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ0_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ1_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ2_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ3_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ4_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ5_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ6_IRQHandler = Default_Handler
#pragma weak CAN_DMAREQ7_IRQHandler = Default_Handler
#pragma weak CAN0_TX_IRQHandler = Default_Handler
#pragma weak CAN0_CHERR_IRQHandler = Default_Handler
#pragma weak CAN0_COMFRX_IRQHandler = Default_Handler
#pragma weak CAN0_CF_DMAREQ_IRQHandler = Default_Handler
#pragma weak CAN1_TX_IRQHandler = Default_Handler
#pragma weak CAN1_CHERR_IRQHandler = Default_Handler
#pragma weak CAN1_COMFRX_IRQHandler = Default_Handler
#pragma weak CAN1_CF_DMAREQ_IRQHandler = Default_Handler
#pragma weak USBFS_FIFO_0_IRQHandler = Default_Handler
#pragma weak USBFS_FIFO_1_IRQHandler = Default_Handler
#pragma weak USBFS_INT_IRQHandler = Default_Handler
#pragma weak USBFS_RESUME_IRQHandler = Default_Handler
#pragma weak IIC0_RXI_IRQHandler = Default_Handler
#pragma weak IIC0_TXI_IRQHandler = Default_Handler
#pragma weak IIC0_TEI_IRQHandler = Default_Handler
#pragma weak IIC0_ERI_IRQHandler = Default_Handler
#pragma weak IIC0_WUI_IRQHandler = Default_Handler
#pragma weak IIC1_RXI_IRQHandler = Default_Handler
#pragma weak IIC1_TXI_IRQHandler = Default_Handler
#pragma weak IIC1_TEI_IRQHandler = Default_Handler
#pragma weak IIC1_ERI_IRQHandler = Default_Handler
#pragma weak IIC2_RXI_IRQHandler = Default_Handler
#pragma weak IIC2_TXI_IRQHandler = Default_Handler
#pragma weak IIC2_TEI_IRQHandler = Default_Handler
#pragma weak IIC2_ERI_IRQHandler = Default_Handler
#pragma weak SDHIMMC0_ACCS_IRQHandler = Default_Handler
#pragma weak SDHIMMC0_SDIO_IRQHandler = Default_Handler
#pragma weak SDHIMMC0_CARD_IRQHandler = Default_Handler
#pragma weak SDHIMMC0_DMA_REQ_IRQHandler = Default_Handler
#pragma weak SSI0_TXI_IRQHandler = Default_Handler
#pragma weak SSI0_RXI_IRQHandler = Default_Handler
#pragma weak SSI0_INT_IRQHandler = Default_Handler
#pragma weak CTSU_WRITE_IRQHandler = Default_Handler
#pragma weak CTSU_READ_IRQHandler = Default_Handler
#pragma weak CTSU_END_IRQHandler = Default_Handler
#pragma weak CAC_FREQUENCY_ERROR_IRQHandler = Default_Handler
#pragma weak CAC_MEASUREMENT_END_IRQHandler = Default_Handler
#pragma weak CAC_OVERFLOW_IRQHandler = Default_Handler
#pragma weak CEC_INTDA_IRQHandler = Default_Handler
#pragma weak CEC_INTCE_IRQHandler = Default_Handler
#pragma weak CEC_INTERR_IRQHandler = Default_Handler
#pragma weak IOPORT_EVENT_1_IRQHandler = Default_Handler
#pragma weak IOPORT_EVENT_2_IRQHandler = Default_Handler
#pragma weak IOPORT_EVENT_3_IRQHandler = Default_Handler
#pragma weak IOPORT_EVENT_4_IRQHandler = Default_Handler
#pragma weak ELC_SOFTWARE_EVENT_0_IRQHandler = Default_Handler
#pragma weak ELC_SOFTWARE_EVENT_1_IRQHandler = Default_Handler
#pragma weak POEG0_EVENT_IRQHandler = Default_Handler
#pragma weak POEG1_EVENT_IRQHandler = Default_Handler
#pragma weak POEG2_EVENT_IRQHandler = Default_Handler
#pragma weak POEG3_EVENT_IRQHandler = Default_Handler
#pragma weak GPT0_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT0_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT0_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT0_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT0_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT0_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT0_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT0_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT0_PC_IRQHandler = Default_Handler
#pragma weak GPT1_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT1_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT1_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT1_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT1_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT1_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT1_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT1_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT1_PC_IRQHandler = Default_Handler
#pragma weak GPT2_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT2_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT2_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT2_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT2_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT2_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT2_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT2_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT3_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT3_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT3_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT3_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT3_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT3_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT3_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT3_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT4_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT4_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT4_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT4_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT4_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT4_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT4_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT4_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT4_PC_IRQHandler = Default_Handler
#pragma weak GPT5_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT5_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT5_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT5_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT5_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT5_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT5_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT5_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT5_PC_IRQHandler = Default_Handler
#pragma weak GPT6_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT6_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT6_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT6_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT6_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT6_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT6_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT6_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT6_PC_IRQHandler = Default_Handler
#pragma weak GPT7_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT7_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT7_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT7_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT7_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT7_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT7_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT7_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT8_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT8_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT8_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT8_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT8_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT8_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT8_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT8_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak GPT9_CAPTURE_COMPARE_A_IRQHandler = Default_Handler
#pragma weak GPT9_CAPTURE_COMPARE_B_IRQHandler = Default_Handler
#pragma weak GPT9_COMPARE_C_IRQHandler = Default_Handler
#pragma weak GPT9_COMPARE_D_IRQHandler = Default_Handler
#pragma weak GPT9_COMPARE_E_IRQHandler = Default_Handler
#pragma weak GPT9_COMPARE_F_IRQHandler = Default_Handler
#pragma weak GPT9_COUNTER_OVERFLOW_IRQHandler = Default_Handler
#pragma weak GPT9_COUNTER_UNDERFLOW_IRQHandler = Default_Handler
#pragma weak OPS_UVW_EDGE_IRQHandler = Default_Handler
#pragma weak ADC0_SCAN_END_IRQHandler = Default_Handler
#pragma weak ADC0_SCAN_END_B_IRQHandler = Default_Handler
#pragma weak ADC0_WINDOW_A_IRQHandler = Default_Handler
#pragma weak ADC0_WINDOW_B_IRQHandler = Default_Handler
#pragma weak ADC0_COMPARE_MATCH_IRQHandler = Default_Handler
#pragma weak ADC0_COMPARE_MISMATCH_IRQHandler = Default_Handler
#pragma weak ADC1_SCAN_END_IRQHandler = Default_Handler
#pragma weak ADC1_SCAN_END_B_IRQHandler = Default_Handler
#pragma weak ADC1_WINDOW_A_IRQHandler = Default_Handler
#pragma weak ADC1_WINDOW_B_IRQHandler = Default_Handler
#pragma weak ADC1_COMPARE_MATCH_IRQHandler = Default_Handler
#pragma weak ADC1_COMPARE_MISMATCH_IRQHandler = Default_Handler
#pragma weak EDMAC0_EINT_IRQHandler = Default_Handler
#pragma weak USBHS_FIFO_0_IRQHandler = Default_Handler
#pragma weak USBHS_FIFO_1_IRQHandler = Default_Handler
#pragma weak USBHS_USB_INT_RESUME_IRQHandler = Default_Handler
#pragma weak SCI0_RXI_IRQHandler = Default_Handler
#pragma weak SCI0_TXI_IRQHandler = Default_Handler
#pragma weak SCI0_TEI_IRQHandler = Default_Handler
#pragma weak SCI0_ERI_IRQHandler = Default_Handler
#pragma weak SCI0_AM_IRQHandler = Default_Handler
#pragma weak SCI0_RXI_OR_ERI_IRQHandler = Default_Handler
#pragma weak SCI1_RXI_IRQHandler = Default_Handler
#pragma weak SCI1_TXI_IRQHandler = Default_Handler
#pragma weak SCI1_TEI_IRQHandler = Default_Handler
#pragma weak SCI1_ERI_IRQHandler = Default_Handler
#pragma weak SCI2_RXI_IRQHandler = Default_Handler
#pragma weak SCI2_TXI_IRQHandler = Default_Handler
#pragma weak SCI2_TEI_IRQHandler = Default_Handler
#pragma weak SCI2_ERI_IRQHandler = Default_Handler
#pragma weak SCI3_RXI_IRQHandler = Default_Handler
#pragma weak SCI3_TXI_IRQHandler = Default_Handler
#pragma weak SCI3_TEI_IRQHandler = Default_Handler
#pragma weak SCI3_ERI_IRQHandler = Default_Handler
#pragma weak SCI3_AM_IRQHandler = Default_Handler
#pragma weak SCI4_RXI_IRQHandler = Default_Handler
#pragma weak SCI4_TXI_IRQHandler = Default_Handler
#pragma weak SCI4_TEI_IRQHandler = Default_Handler
#pragma weak SCI4_ERI_IRQHandler = Default_Handler
#pragma weak SCI4_AM_IRQHandler = Default_Handler
#pragma weak SCI5_RXI_IRQHandler = Default_Handler
#pragma weak SCI5_TXI_IRQHandler = Default_Handler
#pragma weak SCI5_TEI_IRQHandler = Default_Handler
#pragma weak SCI5_ERI_IRQHandler = Default_Handler
#pragma weak SCI5_AM_IRQHandler = Default_Handler
#pragma weak SCI6_RXI_IRQHandler = Default_Handler
#pragma weak SCI6_TXI_IRQHandler = Default_Handler
#pragma weak SCI6_TEI_IRQHandler = Default_Handler
#pragma weak SCI6_ERI_IRQHandler = Default_Handler
#pragma weak SCI6_AM_IRQHandler = Default_Handler
#pragma weak SCI7_RXI_IRQHandler = Default_Handler
#pragma weak SCI7_TXI_IRQHandler = Default_Handler
#pragma weak SCI7_TEI_IRQHandler = Default_Handler
#pragma weak SCI7_ERI_IRQHandler = Default_Handler
#pragma weak SCI7_AM_IRQHandler = Default_Handler
#pragma weak SCI8_RXI_IRQHandler = Default_Handler
#pragma weak SCI8_TXI_IRQHandler = Default_Handler
#pragma weak SCI8_TEI_IRQHandler = Default_Handler
#pragma weak SCI8_ERI_IRQHandler = Default_Handler
#pragma weak SCI8_AM_IRQHandler = Default_Handler
#pragma weak SCI9_RXI_IRQHandler = Default_Handler
#pragma weak SCI9_TXI_IRQHandler = Default_Handler
#pragma weak SCI9_TEI_IRQHandler = Default_Handler
#pragma weak SCI9_ERI_IRQHandler = Default_Handler
#pragma weak SCI9_AM_IRQHandler = Default_Handler
#pragma weak SCIX0_SCIX0_IRQHandler = Default_Handler
#pragma weak SCIX0_SCIX1_IRQHandler = Default_Handler
#pragma weak SCIX0_SCIX2_IRQHandler = Default_Handler
#pragma weak SCIX0_SCIX3_IRQHandler = Default_Handler
#pragma weak SCIX1_SCIX0_IRQHandler = Default_Handler
#pragma weak SCIX1_SCIX1_IRQHandler = Default_Handler
#pragma weak SCIX1_SCIX2_IRQHandler = Default_Handler
#pragma weak SCIX1_SCIX3_IRQHandler = Default_Handler
#pragma weak SPI0_RXI_IRQHandler = Default_Handler
#pragma weak SPI0_TXI_IRQHandler = Default_Handler
#pragma weak SPI0_IDLE_IRQHandler = Default_Handler
#pragma weak SPI0_ERI_IRQHandler = Default_Handler
#pragma weak SPI0_TEI_IRQHandler = Default_Handler
#pragma weak SPI1_RXI_IRQHandler = Default_Handler
#pragma weak SPI1_TXI_IRQHandler = Default_Handler
#pragma weak SPI1_IDLE_IRQHandler = Default_Handler
#pragma weak SPI1_ERI_IRQHandler = Default_Handler
#pragma weak SPI1_TEI_IRQHandler = Default_Handler
#pragma weak CAN_AFLRAM0_ERI_IRQHandler = Default_Handler
#pragma weak CAN_AFLRAM1_ERI_IRQHandler = Default_Handler
#pragma weak CAN_MRAM_ERI_IRQHandler = Default_Handler
#pragma weak OSPI_INT_IRQHandler = Default_Handler
#pragma weak QSPI_INT_IRQHandler = Default_Handler
#pragma weak DOC_INT_IRQHandler = Default_Handler

//Vector table
#pragma language = extended
#pragma segment = "CSTACK"
#pragma section = ".intvec"
#pragma location = ".intvec"
const uint32_t __vector_table[320] =
{
   (uint32_t) __sfe("CSTACK"),

   (uint32_t) Reset_Handler,
   (uint32_t) NMI_Handler,
   (uint32_t) HardFault_Handler,
   (uint32_t) MemManage_Handler,
   (uint32_t) BusFault_Handler,
   (uint32_t) UsageFault_Handler,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) SVC_Handler,
   (uint32_t) DebugMon_Handler,
   (uint32_t) 0,
   (uint32_t) PendSV_Handler,
   (uint32_t) SysTick_Handler,

